//======================================================================================================================
//
//  プレイヤーの歩きステートクラス[PlayerStateWalk.cs]
//
//-- 詳細 --------------------------------------------------------------------------------------------------------------
// 歩き時の処理を実装する。
// 
//----------------------------------------------------------------------------------------------------------------------
// 更新日     更新者       更新内容
// ---------- ------------ ---------------------------------------------------------------------------------------------
// yyyy/mm/dd anonymous    hoge
// 2023/09/14 大行佑也     新規作成
//
//======================================================================================================================
using System.Collections;
using System.Collections.Generic;
using UnityEngine;

namespace BTLGeek.Character.Player.State
{
    public class PlayerStateWalk : Common.State<Player>
    {
        // Start is called before the first frame update
        protected override void Start()
        {
            // 基底クラスのStartメソッドを先に実行する。
            base.Start();
            // 歩くアニメーションを再生

        }
    
        // Update is called once per frame
        void Update()
        {
            
        }
    }
}
